# Sandbox for sklearn 101

In [2]:
import sklearn,numpy as np, pandas as pd, pprint

In [3]:
train_df = pd.read_csv('act_train.csv')

In [4]:
train_df.dtypes

people_id            object
activity_id          object
date                 object
activity_category    object
char_1               object
char_2               object
char_3               object
char_4               object
char_5               object
char_6               object
char_7               object
char_8               object
char_9               object
char_10              object
outcome               int64
dtype: object

In [5]:
train_df.values

array([['ppl_100', 'act2_1734928', '2023-08-26', ..., nan, 'type 76', 0L],
       ['ppl_100', 'act2_2434093', '2022-09-27', ..., nan, 'type 1', 0L],
       ['ppl_100', 'act2_3404049', '2022-09-27', ..., nan, 'type 1', 0L],
       ...,
       ['ppl_99994', 'act2_536973', '2023-01-19', ..., nan, 'type 1', 1L],
       ['ppl_99994', 'act2_688656', '2023-05-02', ..., nan, 'type 199', 1L],
       ['ppl_99994', 'act2_715089', '2023-06-15', ..., nan, 'type 1', 1L]], dtype=object)

In [6]:
train_df.head(5)

,people_id,activity_id,date,activity_category,char_1,char_2,char_3,char_4,char_5,char_6,char_7,char_8,char_9,char_10,outcome
0,ppl_100,act2_1734928,2023-08-26,type 4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 76,0
1,ppl_100,act2_2434093,2022-09-27,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0
2,ppl_100,act2_3404049,2022-09-27,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0
3,ppl_100,act2_3651215,2023-08-04,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0
4,ppl_100,act2_4109017,2023-08-26,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0

In [7]:
train_df['activity_category'].unique()

array(['type 4', 'type 2', 'type 3', 'type 5', 'type 1', 'type 7', 'type 6'], dtype=object)

In [8]:
train_df['char_10'].unique() # 6516 unique values

array(['type 76', 'type 1', 'type 1727', ..., 'type 7356', 'type 6865',
       'type 7379'], dtype=object)

In [9]:
# Count unique keys (classes)
act_col = train_df.columns
summary_act_df = [len(train_df[col].unique()) for col in act_col]
pd.DataFrame(summary_act_df,act_col)

                         0
people_id           151295
activity_id        2197291
date                   411
activity_category        7
char_1                  52
char_2                  33
char_3                  12
char_4                   8
char_5                   8
char_6                   6
char_7                   9
char_8                  19
char_9                  20
char_10               6516
outcome                  2

# --------------------------------------------------

In [10]:
people_df = pd.read_csv('people.csv')

In [11]:
people_df.head(5)

,people_id,char_1,group_1,char_2,date,char_3,char_4,char_5,char_6,char_7,...,char_29,char_30,char_31,char_32,char_33,char_34,char_35,char_36,char_37,char_38
0,ppl_100,type 2,group 17304,type 2,2021-06-29,type 5,type 5,type 5,type 3,type 11,...,False,True,True,False,False,True,True,True,False,36
1,ppl_100002,type 2,group 8688,type 3,2021-01-06,type 28,type 9,type 5,type 3,type 11,...,False,True,True,True,True,True,True,True,False,76
2,ppl_100003,type 2,group 33592,type 3,2022-06-10,type 4,type 8,type 5,type 2,type 5,...,False,False,True,True,True,True,False,True,True,99
3,ppl_100004,type 2,group 22593,type 3,2022-07-20,type 40,type 25,type 9,type 4,type 16,...,True,True,True,True,True,True,True,True,True,76
4,ppl_100006,type 2,group 6534,type 3,2022-07-27,type 40,type 25,type 9,type 3,type 8,...,False,False,True,False,False,False,True,True,False,84

In [12]:
people_col = people_df.columns
summary_ppl_df = [len(people_df[col].unique()) for col in people_col]
pd.DataFrame(summary_ppl_df,people_col)

                0
people_id  189118
char_1          2
group_1     34224
char_2          3
date         1196
char_3         43
char_4         25
char_5          9
char_6          7
char_7         25
char_8          8
char_9          9
char_10         2
char_11         2
char_12         2
char_13         2
char_14         2
char_15         2
char_16         2
char_17         2
char_18         2
char_19         2
char_20         2
char_21         2
char_22         2
char_23         2
char_24         2
char_25         2
char_26         2
char_27         2
char_28         2
char_29         2
char_30         2
char_31         2
char_32         2
char_33         2
char_34         2
char_35         2
char_36         2
char_37         2
char_38       101

## Merge 2 tables

In [13]:
train_df.shape

(2197291, 15)

In [14]:
merged_df = pd.merge(train_df, people_df, on='people_id')

In [15]:
len(merged_df)

2197291

In [16]:
merged_df.head(5)

,people_id,activity_id,date_x,activity_category,char_1_x,char_2_x,char_3_x,char_4_x,char_5_x,char_6_x,...,char_29,char_30,char_31,char_32,char_33,char_34,char_35,char_36,char_37,char_38
0,ppl_100,act2_1734928,2023-08-26,type 4,NaN,NaN,NaN,NaN,NaN,NaN,...,False,True,True,False,False,True,True,True,False,36
1,ppl_100,act2_2434093,2022-09-27,type 2,NaN,NaN,NaN,NaN,NaN,NaN,...,False,True,True,False,False,True,True,True,False,36
2,ppl_100,act2_3404049,2022-09-27,type 2,NaN,NaN,NaN,NaN,NaN,NaN,...,False,True,True,False,False,True,True,True,False,36
3,ppl_100,act2_3651215,2023-08-04,type 2,NaN,NaN,NaN,NaN,NaN,NaN,...,False,True,True,False,False,True,True,True,False,36
4,ppl_100,act2_4109017,2023-08-26,type 2,NaN,NaN,NaN,NaN,NaN,NaN,...,False,True,True,False,False,True,True,True,False,36

In [17]:
merged_col = merged_df.columns
summary_merged_df = [len(merged_df[col].unique()) for col in merged_col]
pd.DataFrame(summary_merged_df,merged_col)

                         0
people_id           151295
activity_id        2197291
date_x                 411
activity_category        7
char_1_x                52
char_2_x                33
char_3_x                12
char_4_x                 8
char_5_x                 8
char_6_x                 6
char_7_x                 9
char_8_x                19
char_9_x                20
char_10_x             6516
outcome                  2
char_1_y                 2
group_1              29899
char_2_y                 3
date_y                1196
char_3_y                43
char_4_y                25
char_5_y                 9
char_6_y                 7
char_7_y                25
char_8_y                 8
char_9_y                 9
char_10_y                2
char_11                  2
char_12                  2
char_13                  2
char_14                  2
char_15                  2
char_16                  2
char_17                  2
char_18                  2
char_19                  2
char_20                  2
char_21                  2
char_22                  2
char_23                  2
char_24                  2
char_25                  2
char_26                  2
char_27                  2
char_28                  2
char_29                  2
char_30                  2
char_31                  2
char_32                  2
char_33                  2
char_34                  2
char_35                  2
char_36                  2
char_37                  2
char_38                101

In [18]:
merged_df['char_38'].describe()

count    2.197291e+06
mean     4.998051e+01
std      3.608557e+01
min      0.000000e+00
25%      0.000000e+00
50%      5.900000e+01
75%      8.200000e+01
max      1.000000e+02
Name: char_38, dtype: float64

In [19]:
merged_df['char_7_y'].describe()

count     2197291
unique         25
top        type 8
freq       263444
Name: char_7_y, dtype: object

## Look at test set

In [20]:
test_df = pd.read_csv('act_test.csv')

In [21]:
test_df.head(5)

,people_id,activity_id,date,activity_category,char_1,char_2,char_3,char_4,char_5,char_6,char_7,char_8,char_9,char_10
0,ppl_100004,act1_249281,2022-07-20,type 1,type 5,type 10,type 5,type 1,type 6,type 1,type 1,type 7,type 4,NaN
1,ppl_100004,act2_230855,2022-07-20,type 5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 682
2,ppl_10001,act1_240724,2022-10-14,type 1,type 12,type 1,type 5,type 4,type 6,type 1,type 1,type 13,type 10,NaN
3,ppl_10001,act1_83552,2022-11-27,type 1,type 20,type 10,type 5,type 4,type 6,type 1,type 1,type 5,type 5,NaN
4,ppl_10001,act2_1043301,2022-10-15,type 5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 3015

In [22]:
test_col = test_df.columns
summary_test_df = [len(test_df[col].unique()) for col in test_col]
pd.DataFrame(summary_test_df,test_col)

                        0
people_id           37823
activity_id        498687
date                  411
activity_category       7
char_1                 49
char_2                 32
char_3                 12
char_4                  8
char_5                  7
char_6                  6
char_7                  9
char_8                 19
char_9                 20
char_10              3962

In [23]:
setA = set(train_df['char_8'])
setB = set(test_df['char_8'])
setA.union(setB) - setA.intersection(setB)

set()

## Convert attributes
- Categorical : type ## / NaN
- Boolean (True False)

# category types attribute 
for i in range(len(merged_df)):
    for col in merged_col:
        val = merged_df[col][i]
        if(type(val) == str and val.startswith('type')):
            merged_df[col][i] = int(val.split(' ')[1])
        elif(val == np.nan):
            merged_df[col][i] = 0
        elif(type(val) == bool):
            merged_df[col][i] = int(val)

In [100]:
#merged_df['char_1_x'].replace({'type':'', ' ':'', np.nan : '0'}, regex = True).astype('int')
#Columns to be converted
merged_df = pd.merge(train_df, people_df, on='people_id')
parsed_col = set(merged_col) - set(['people_id','activity_id','date_x','date_y'])
for col in parsed_col:
    print (col)
    if(type(merged_df[col][0]) is np.bool_):
        print('- is boolean')
        merged_df[col] = merged_df[col].astype('int64')
    elif (type(merged_df[col][0]) is np.int64 or type(merged_df[col][0]) is np.long):
        print('- is integer')
        merged_df[col] = merged_df[col].astype('int64')
    else:
        print('- is type/category')
        merged_df[col] = merged_df[col].replace({'group': '', 'type':'', ' ':'', np.nan : '0'}, regex = True).astype('int64')

group_1
- is type/category
char_12
- is boolean
char_33
- is boolean
char_2_y
- is type/category
activity_category
- is type/category
char_38
- is integer
char_1_y
- is type/category
char_8_y
- is type/category
char_19
- is boolean
char_18
- is boolean
char_17
- is boolean
char_8_x
- is type/category
char_15
- is boolean
char_32
- is boolean
char_9_y
- is type/category
char_9_x
- is type/category
char_11
- is boolean
char_1_x
- is type/category
char_3_y
- is type/category
char_3_x
- is type/category
char_6_y
- is type/category
char_5_y
- is type/category
char_31
- is boolean
outcome
- is integer
char_25
- is boolean
char_10_x
- is type/category
char_10_y
- is boolean
char_30
- is boolean
char_2_x
- is type/category
char_35
- is boolean
char_16
- is boolean
char_26
- is boolean
char_27
- is boolean
char_24
- is boolean
char_14
- is boolean
char_22
- is boolean
char_23
- is boolean
char_20
- is boolean
char_5_x
- is type/category
char_4_x
- is type/category
char_13
- is boolean
char_21
- is boolean
char_28
- is boolean
char_29
- is boolean
char_37
- is boolean
char_6_x
- is type/category
char_4_y
- is type/category
char_34
- is boolean
char_36
- is boolean
char_7_y
- is type/category
char_7_x
- is type/category

In [101]:
merged_df.head(10)
merged_df.columns

Index([u'people_id', u'activity_id', u'date_x', u'activity_category',
       u'char_1_x', u'char_2_x', u'char_3_x', u'char_4_x', u'char_5_x',
       u'char_6_x', u'char_7_x', u'char_8_x', u'char_9_x', u'char_10_x',
       u'outcome', u'char_1_y', u'group_1', u'char_2_y', u'date_y',
       u'char_3_y', u'char_4_y', u'char_5_y', u'char_6_y', u'char_7_y',
       u'char_8_y', u'char_9_y', u'char_10_y', u'char_11', u'char_12',
       u'char_13', u'char_14', u'char_15', u'char_16', u'char_17', u'char_18',
       u'char_19', u'char_20', u'char_21', u'char_22', u'char_23', u'char_24',
       u'char_25', u'char_26', u'char_27', u'char_28', u'char_29', u'char_30',
       u'char_31', u'char_32', u'char_33', u'char_34', u'char_35', u'char_36',
       u'char_37', u'char_38'],
      dtype='object')

In [105]:
train_dataset = merged_df.drop(['people_id','activity_id','date_x','date_y','outcome'], 1)
train_outcome = np.array(merged_df.outcome)
train_mat = np.array(train_dataset, dtype='int')

In [111]:
train_outcome

array([0, 0, 0, ..., 1, 1, 1], dtype=int64)

In [109]:
train_mat

array([[ 4,  0,  0, ...,  1,  0, 36],
       [ 2,  0,  0, ...,  1,  0, 36],
       [ 2,  0,  0, ...,  1,  0, 36],
       ...,
       [ 2,  0,  0, ...,  1,  1, 95],
       [ 4,  0,  0, ...,  1,  1, 95],
       [ 2,  0,  0, ...,  1,  1, 95]])

## Try building a model